"""
    ======= Memory and Pointers =======
    الباب الثاني

    يقصد بالذاكرة هنا ذاكرة الوصول العشوائي
    RAM
    وهي مكان لتخزين البيانات تتكون من
    خلايا كل خلية لها عنوان خاص بها و 
    يمزها عن غيرها
"""

f"""
    لان عناوين الذاكرة طويلة ويصعب حفظه و تذكرها
    فإن المتغريات تستخدم لحل هذه المشكلة
    لاحظ المتغير التالي
    {
        variable = 201
        """
        يشير
        variable 
        إلى القيمة 201
        في الذاكرة  بدلا من :

        """
        variable_name_in_memory = hex(id(variable))
        """
        المثال اعلاه يعطي قيمة الخلية المحفوظ فيها المتغير
        variable

        والنتيجة تقريبا :
        0x957740

        لان اسماء خلايا الذاكرة تكون بصيغة ست عشرية
        استخدمنا 
        hex()
        للتحويل
        """
    }
"""


"""
    مفهوم المؤشرات pointers

    عبارة عن متغير يخزن عنوان متغير إخر في الذاكرة
    اي قيمة المؤشر تكون عنوانا في الذاكرة

    في الحقيقة البايثون ليس فيها مفهوم المؤشرات لان البايون تعتمد على كون جميع
    المتغيرات فيها عبارة عن كائنات


    مفهوم المراجع References
    مفهوم قريب من المؤشرات بحيث أن المتغير يشير إلى متغير اخر

    والبايثون لا تستخدم هذا المفهوم مباشرة لكن قريب منه
"""